{
  "feature_id": "feature-006",
  "feature_name": "Cargo Workspace Restructuring - Phase 1: Core Crate Extraction",
  "description": "Convert desktop/src-tauri/ from a monolithic single crate into a Cargo workspace, extracting the core traits module into a standalone crate. This is an incremental first step that proves the workspace pattern while keeping the change minimal and compilable.",
  "stories": [
    {
      "id": "story-1",
      "title": "Create workspace Cargo.toml and core crate skeleton",
      "description": "Convert the existing desktop/src-tauri/Cargo.toml into a workspace root and create the crates/core/ directory structure with its own Cargo.toml. The core crate (plan-cascade-core) should have minimal dependencies: serde, serde_json, async-trait, thiserror.",
      "acceptance_criteria": [
        "desktop/src-tauri/Cargo.toml defines a [workspace] with members = ['crates/core']",
        "desktop/src-tauri/crates/core/Cargo.toml exists with correct dependencies",
        "desktop/src-tauri/crates/core/src/lib.rs exists as the crate root",
        "The main app crate depends on plan-cascade-core via path dependency"
      ],
      "dependencies": [],
      "estimated_effort": "medium"
    },
    {
      "id": "story-2",
      "title": "Move core module contents into the core crate",
      "description": "Move the extractable core module files (error types, context hierarchy, tool traits, builders) into the new core crate. Leave adapter.rs, compaction.rs, and event_actions.rs in the main crate since they have cross-service dependencies. Update the main crate's services/core/mod.rs to re-export from the core crate plus keep the non-extractable modules.",
      "acceptance_criteria": [
        "crates/core/src/lib.rs defines and exports error, context, tool_trait, and builders modules",
        "Error types (AppError, AppResult) are defined in the core crate",
        "ExecutionContext, ToolContext, OrchestratorContext are in the core crate",
        "ToolDefinitionTrait, ToolExecutable, UnifiedTool, UnifiedToolRegistry are in the core crate",
        "Builder types and SessionState are in the core crate",
        "services/core/mod.rs re-exports from plan-cascade-core"
      ],
      "dependencies": ["story-1"],
      "estimated_effort": "large"
    },
    {
      "id": "story-3",
      "title": "Update imports across the codebase and verify compilation",
      "description": "Update all imports in the main app crate that reference the moved types. Since services/core/mod.rs re-exports everything, most imports should continue to work. Fix any remaining compilation issues. Verify with cargo check.",
      "acceptance_criteria": [
        "cargo check -p plan-cascade-core passes",
        "cargo check --lib (main app crate) passes or only fails due to missing frontend dist"
      ],
      "dependencies": ["story-2"],
      "estimated_effort": "medium"
    }
  ],
  "constraints": [
    "Dependency graph must be strictly unidirectional: core has no dependency on any other workspace crate",
    "The adapter.rs, compaction.rs, and event_actions.rs remain in the main crate due to cross-service dependencies",
    "All existing tests in the core module should continue to pass",
    "Frontend dist directory doesn't exist so binary compilation is expected to fail; cargo check --lib is the success criteria"
  ]
}
